In [106]:
import pandas as pd
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 1000)

In [107]:
melb_data = pd.read_csv('data/melb_data_ps.csv',sep=',')
melb_df = melb_data.copy()

melb_df.head()

   index      Suburb           Address  Rooms Type      Price Method SellerG       Date  Distance  Postcode  Bedroom  Bathroom  Car  Landsize  BuildingArea  YearBuilt CouncilArea  Lattitude  Longtitude             Regionname  Propertycount         Coordinates
0      0  Abbotsford      85 Turner St      2    h  1480000.0      S  Biggin  3/12/2016       2.5      3067        2         1    1     202.0         126.0       1970       Yarra   -37.7996    144.9984  Northern Metropolitan           4019  -37.7996, 144.9984
1      1  Abbotsford   25 Bloomburg St      2    h  1035000.0      S  Biggin  4/02/2016       2.5      3067        2         1    0     156.0          79.0       1900       Yarra   -37.8079    144.9934  Northern Metropolitan           4019  -37.8079, 144.9934
2      2  Abbotsford      5 Charles St      3    h  1465000.0     SP  Biggin  4/03/2017       2.5      3067        3         2    0     134.0         150.0       1900       Yarra   -37.8093    144.9944  Northern Metropolitan           4019  -37.8093, 144.9944
3      3  Abbotsford  40 Federation La      3    h   850000.0     PI  Biggin  4/03/2017       2.5      3067        3         2    1      94.0         126.0       1970       Yarra   -37.7969    144.9969  Northern Metropolitan           4019  -37.7969, 144.9969
4      4  Abbotsford       55a Park St      4    h  1600000.0     VB  Nelson  4/06/2016       2.5      3067        3         1    2     120.0         142.0       2014       Yarra   -37.8072    144.9941  Northern Metropolitan           4019  -37.8072, 144.9941

In [108]:
price_square = melb_df['Price']**2

price_square

0        2.190400e+12
1        1.071225e+12
2        2.146225e+12
3        7.225000e+11
4        2.560000e+12
             ...
13575    1.550025e+12
13576    1.062961e+12
13577    1.368900e+12
13578    6.250000e+12
13579    1.651225e+12
Name: Price, Length: 13580, dtype: float64

In [109]:
price_square = []
for price in melb_df['Price']:
    price_square.append(price**2)
price_square = pd.Series(price_square)

price_square

0        2.190400e+12
1        1.071225e+12
2        2.146225e+12
3        7.225000e+11
4        2.560000e+12
             ...
13575    1.550025e+12
13576    1.062961e+12
13577    1.368900e+12
13578    6.250000e+12
13579    1.651225e+12
Length: 13580, dtype: float64

In [110]:
customer_df = pd.DataFrame({
        'number': [0, 1, 2, 3, 4],
        'cust_id': [128, 1201, 9832, 4392, 7472],
        'cust_age': [13, 21, 19, 21, 60],
        'cust_sale': [0, 0, 0.2, 0.15, 0.3],
        'cust_year_birth': [2008, 2000, 2002, 2000, 1961],
        'cust_order': [1400, 14142, 900, 1240, 8430]
    })


customer_df

   number  cust_id  cust_age  cust_sale  cust_year_birth  cust_order
0       0      128        13       0.00             2008        1400
1       1     1201        21       0.00             2000       14142
2       2     9832        19       0.20             2002         900
3       3     4392        21       0.15             2000        1240
4       4     7472        60       0.30             1961        8430

In [111]:
countries_df = pd.DataFrame({
    'country': ['Англия', 'Канада', 'США', 'Россия', 'Украина', 'Беларусь', 'Казахстан'],
    'population': [56.29, 38.05, 322.28, 146.24, 45.5, 9.5, 17.04],
    'square': [133396, 9984670, 9826630, 17125191, 603628, 207600, 2724902]
})

countries_df

     country  population    square
0     Англия       56.29    133396
1     Канада       38.05   9984670
2        США      322.28   9826630
3     Россия      146.24  17125191
4    Украина       45.50    603628
5   Беларусь        9.50    207600
6  Казахстан       17.04   2724902

In [112]:
density = (countries_df['population']*1000000)/countries_df['square']

round(density.mean(),2)

84.93

### Task 3.4 - 3.5

In [113]:
import pandas as pd

ufo_data = pd.read_csv('https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/ufo.csv',sep=',')

ufo_data.head(10)

                   City Colors Reported Shape Reported State              Time
0                Ithaca             NaN       TRIANGLE    NY    6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ   6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO   2/15/1931 14:00
3               Abilene             NaN           DISK    KS    6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY   4/18/1933 19:00
5           Valley City             NaN           DISK    ND   9/15/1934 15:30
6           Crater Lake             NaN         CIRCLE    CA    6/15/1935 0:00
7                  Alma             NaN           DISK    MI    7/15/1936 0:00
8               Eklutna             NaN          CIGAR    AK  10/15/1936 17:00
9               Hubbard             NaN       CYLINDER    OR    6/15/1937 0:00

In [114]:
ufo_data.describe()

           City Colors Reported Shape Reported  State              Time
count     18216            2882          15597  18241             18241
unique     6476              27             27     52             16145
top     Seattle             RED          LIGHT     CA  11/16/1999 19:00
freq        187             780           2803   2529                27

In [115]:
ufo_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18241 entries, 0 to 18240
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   City             18216 non-null  object
 1   Colors Reported  2882 non-null   object
 2   Shape Reported   15597 non-null  object
 3   State            18241 non-null  object
 4   Time             18241 non-null  object
dtypes: object(5)
memory usage: 712.7+ KB

In [116]:
ufo_data['Time'] = pd.to_datetime(ufo_data['Time'],dayfirst=True)
ufo_data['Time'].mode()

0   1999-11-16 19:00:00
Name: Time, dtype: datetime64[ns]

In [117]:
ufo_data.describe().loc[:,['Time']]

C:\Users\Alex\AppData\Local\Temp\ipykernel_8340\840556326.py:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  ufo_data.describe().loc[:,['Time']]

                       Time
count                 18241
unique                16145
top     1999-11-16 19:00:00
freq                     27
first   1930-01-06 22:00:00
last    2000-12-31 23:59:00

In [119]:
ufo_data['Date'] = ufo_data['Time'].dt.date
 
round(ufo_data[ufo_data['State']=='NV']['Date'].diff().dt.days.mean())

69